posts/1912-plato-cave.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-08 Wed 17:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Plato's cave, Bill Hicks &amp; art in general</title>
<meta name="generator" content="Org mode" />
<link rel='stylesheet' type='text/css' href='../css/default.css' />
<link rel='stylesheet' type='text/css' href='../css/style.css' />
<link rel='stylesheet' type='text/css' href='../css/code.css' />
<meta name='viewport' content='width=device-width, initial-scale=1.0' />

</head>
<body>
<div id="preamble" class="status">
<h1 class='title'>Plato's cave, Bill Hicks & art in general<br/><span class='subtitle'>aka dimensions, reality and the role of art</span><br/><span class='subtitle date'>2019-12-16</span></h1>
</div>
<div id="content">
<p>
Up until recently I hadn't read the actual story of Plato's cave, I just knew the gist of it. But weird thoughts emerged which led me to read about it - and then write about it.
</p>

<div id="outline-container-org2322cb3" class="outline-2">
<h2 id="org2322cb3">Plato's cave</h2>
<div class="outline-text-2" id="text-org2322cb3">
<p>
I became familiar with the <b>title</b> (not so much about the context) <b>Plato's cave</b> after seeing <b>Matrix</b>. The parallel lines between Matrix and this story is about
</p>
<ul class="org-ul">
<li>perceiving as real a projection/fake reality</li>
<li>breaking through into the real world</li>
</ul>

<p>
The story of Plato's cave goes like this. Some prisoners live deep in a cave, chained, and looking on the wall of the cave without being able to move their body or even their heads. The only thing that they can see is the wall of the cave, upon which certain shadow shapes appear. The shadows are cast from a fire that is burning.
</p>

<p>
Between the fire and the prisoners there is a small road where certain objects are put, like statues etc, and people pass by, there are people talking and so on. As Socrates points out, the prisoners see only the shadows of all these, and attribute the voices they hear to these shadows. This is reality for them.
</p>

<p>
Then, in the story, Socrates examines the case of a prisoner breaking free. He steps outside, into the real world and.. he has difficulty seeing from all this light! It takes time for his eyes to adapt to the light, the new shapes, the.. extra dimension! We could say that his reality jumped from 2d into 3d.
</p>

<p class="verse">
Side note: that reminds me of <a href="https://www.goodreads.com/book/show/433567.Flatland?from_search=true&amp;qid=vDaoUTUpz3&amp;rank=4">flatland</a>, a really nice thought experiment about dimensions and reality.<br />
</p>

<p>
So, after his eyes adapted ha can now see these new kind of shapes that are produced  by the sun (aka fire v2.0), our hero now feels bad about the prisoners left behind and for the lack of <b>knowledge</b> they all have there. Thus, he decides to return and to break the news. Upon his descending, he cannot see in the darkness. Again, his eyes need time to adapt. So, judged by the prisoners, he has gone blind. He can no longer distinguish the shadows on the wall, recognize the objects etc. He tells them his story but they don't believe him. How could they? He cannot "see" in their reality, for them he's in a worse state than before leaving.
</p>

<p>
And finally the story finishes with the statement that these prisoners.. might even <b>kill</b> our hero.
</p>
</div>
</div>

<div id="outline-container-org35e91fc" class="outline-2">
<h2 id="org35e91fc">Bill Hicks and the point of life</h2>
<div class="outline-text-2" id="text-org35e91fc">
<p>
Upon reading the story itself (and not some synopsis) I was really struck by these last words. That the other prisoners might <b>kill</b> the freed prisoner that returned. This reminded my a sketch of Bill Hicks about the meaning of life. I will not say anything more about it, just watch for yourself.
</p>

<iframe width="560" height="315" src="https://www.youtube.com/embed/KgzQuE1pR1w" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>

<div style="height: 800px; display:flex; flex-direction:column; justify-content: space-around; text-align: center;">
  <p>Intentionally left blank. Watch the f*ing video first</p>
</div>

<blockquote>
<p>
And we.. kill those people
</p>

<p>
&#x2013; Bill Hicks
</p>
</blockquote>
<p>
This sketch, this way of viewing life, has played a major role in developing my view of the world. (This alongside the music of <b>Tool</b> - Tool btw introduced me to Bill Hicks with the intro in their track <a href="https://www.youtube.com/watch?v=51fcG3sxvII">Third Eye</a>)
</p>
</div>
</div>

<div id="outline-container-org407cf86" class="outline-2">
<h2 id="org407cf86">Lights, camera, action!</h2>
<div class="outline-text-2" id="text-org407cf86">
<p>
This brings me to the 3rd item of the title, <b>art</b>. Around the summer of 2019 I was thinking of starting an online course about writing fiction. The motivation came from an idea I had some night. I was picturing some alternative future about Greece (my country of origin), where some new customs have been adopted by the population. I quite liked these ideas, I even spoke about it with some friends, and then realized: what if I were determined to make this happen? To influence this change that I had in mind. How one goes about doing that? Two ways came into my head
</p>
<ul class="org-ul">
<li>direct <br />
..aka politics: starting a movement, or whatever, promoting this agenda</li>
<li>indirect <br />
..aka art</li>
</ul>

<p>
And as you may realized, <b>art</b> was the answer that came in my head. Art is like a Trojan horse, transmitting powerful ideas through a medium that.. has nothing to do with the idea itself! If we return to the story of the cave once more, we see that directly trying to influence people into accepting your version of reality (or truth) doesn't work quite well.
</p>

<p>
So now let's imagine our hero trying to <b>indirectly</b> influence the left behind prisoners. How would he transmit his "virus" of idea? To start with, the analogy of fire casting shadows into a wall and the people looking at these shadows.. feels awfully similar with watching a movie. Or a theater play, or shadow puppetry. You submerge the viewer into an alternate reality, and (ideally) he comes out of the experience with new knowledge/ideas/feelings. So our hero decides to tell a story using these shadows. He gets some people to pretend they are prisoners, he puts them at the point where the fire casts their shadow in the cave wall and&#x2026; action!
</p>

<p>
You cannot force your ideas into these prisoners. But you can make them question their own.
</p>
</div>

<div id="outline-container-org80596e7" class="outline-3">
<h3 id="org80596e7">About dimensions</h3>
<div class="outline-text-3" id="text-org80596e7">
<p>
Another thing that struck me is the fact of the <b>2d</b> shadows that are cast from objects from the <b>3d</b> world in junction with the idea of utilizing these 2d "shadows" to tell a story about the reality of the 3d world. If I were to name the one thing that makes humans worthy of our existence, is the capacity to produce art, and the creations that exist throughout the millennia.
</p>

<p>
Art tells a story, that is more true than reality itself, by using a constrained medium that exists in far less dimensions than reality itself. A small poem can be a few sentences long but can make you ponder for hours. A good theater supersedes the space &amp; time where it takes place, and tells a story about all the people across all ages. And, in my opinion, all this beauty comes from the constraints: few words to describe your ideas, certain dialog to tell a story, limited space for the actors to move. This restrictions force you to make choices. They force you to abstract. And these abstractions is what makes art great.
</p>

<blockquote>
<p>
Through abstraction you provoke imagination.
It's what fills the gaps.
</p>

<p>
&#x2013; Me
</p>
</blockquote>

<p>
While writing this I suddenly thought about <b>Virtual Reality</b>. Based upon what is written above.. VR could not pass a transcendental meaning about reality. You submerge the viewer from his "real" <b>3d</b> world into a virtual.. <b>3d</b> world. The constraints are lost. An alternate reality being shoved down your throat. No gaps to be filled, nothing left to imagine.
</p>
</div>
</div>
</div>

<div id="outline-container-orga5e765e" class="outline-2">
<h2 id="orga5e765e">Instead of an epilogue</h2>
<div class="outline-text-2" id="text-orga5e765e">
<p>
I never (till the time of writing <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-12-12 Thu&gt; </span></span> at least) truly continued with the writing course, but I guess that writing posts such as this one will help me with my writing skills. The end game is to feel comfortable enough to create stories&#x2026; Trojan horses carrying ideas.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<h2>Comments</h2>
Leave your comments below

<div id="disqus_thread"></div>
<script>
  var disqus_config = function () {
  this.page.url = "";  // Replace PAGE_URL with your page's canonical URL variable
  this.page.identifier = "1912-plato-cave"; // Replace PAGE_IDENTIFIER with your page's unique identifier variable
  };
  
  (function() { // DON'T EDIT BELOW THIS LINE
  var d = document, s = d.createElement('script');
  s.src = 'https://actondev-blog.disqus.com/embed.js';
  s.setAttribute('data-timestamp', +new Date());
  (d.head || d.body).appendChild(s);
  })();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</body>
</html>
